//-----------------------------------------------
// 版权归    SivaYao   所有
// 第一次编程时间:2014年07月23日
//-----------------------------------------------
// 文件名：  HD7279.C
// 编写人：  SivaYao 
// 编写时间：2013/05/26
// 目标器件: STC15F2K60S2或者IAP15F2K61S2
// 编译工具: Keil uV3
//-----------------------------------------------
// 程序说明:
// 此函数库用于STC15F2K60S2最小系统板上HD7279所驱
//     动按键显示的控制程序
//-----------------------------------------------

#include     "HD7279.H"


code u8 KeyTable[32]= {0xFF,0xFF,0xFF,0x07,0x04,0x01,0xF6,0xFF,
	                     0xFF,0xFF,0xFF,0x08,0x05,0x02,0x00,0xFF,
	                     0xFF,0xFF,0xFF,0x09,0x06,0x03,0xF5,0xFF,
	                     0xFF,0xFF,0xFF,0xF1,0xF2,0xF3,0xF4,0xFF,	
                       };
//***********************************************
//            五/硬件库程序
//***********************************************
/***********************************************/
//5.1---HD7279(按键显示)驱动集
//**5.1.1-------SEND7279B   (HD7279字节发送子程序)
//**5.1.2-------RECEIVE7279B(HD7279字节接收子程序)
//**5.1.3-------DELAY7279   (HD7279延时子程序)
//**5.1.4-------SEND7279_CMD(HD7279发送单字节指令子程序)
//**5.1.5-------SEND7279_CMD_DATA(HD7279发送带数据指令子程序)
//**5.1.6-------READ7279_KEY(从HD7279读取按键键码)
//**5.1.7-------READ7279_NUM(从HD7279读取按键键值)
/***********************************************/
//---------------------------------------------------------
//名称:(5.1.1)SEND7279B  功能:向HD7279发送一个字节 
//入口:DATAOUT     出口:无   全局:无   调用模块:  DELAY7279
//---------------------------------------------------------
void     SEND7279B (u8 DATAOUT)   //7279字节发送子程序
{
   u8 i;

   DELAY7279  (SYSTEM_OSC/240000);//长延时
   for  ( i=0 ; i<8 ; i++)	{     //8次循环每次发送一个位      
      if     (DATAOUT & 0x80){	  //选择待发送字节的最高位挂载到DAT线上
         DAT   = 1 ; }
	  else {
	     DAT   = 0 ; }
	  CLK        = 1 ;			  //CLK拉高，产生上升沿
	  DELAY7279  (SYSTEM_OSC/1200000)   ;	//短延时
	  CLK        = 0 ;			  //CLK拉低
	  DELAY7279  (SYSTEM_OSC/1200000)   ;	//短延时
	  DATAOUT    = DATAOUT*2 ;}	  //待发送字节左移一位	   
   DAT   = 0 ;					  //DAT线拉低（？？）
   }		  //5.1.1结束
//---------------------------------------------------------
//名称:(5.1.2)RECEIVE7279    功能:从HD7279接收一个字节
//入口:无     出口:DATAIN    全局:无   调用模块:  DELAY7279 
//---------------------------------------------------------
u8    RECEIVE7279B   (void)    //7279字节接收子程序
{
   u8  i,DATAIN = 0 ;

   DAT            = 1 ;	          //DAT线拉高（不拉高接收不了数据）
   DELAY7279 (SYSTEM_OSC/240000); //长延时
   for   (i=0;i<8;i++) {          //循环8次，接收8位数据       
      CLK        = 1     ;        //CLK拉高，产生上升沿
      DELAY7279  (SYSTEM_OSC/1200000)  ;//短延时
	  DATAIN     = DATAIN*2 ;     //已接受数据移位
      if        (DAT) {	          //把DAT线上数据加入数据最低位
	     DATAIN  = DATAIN|0x01 ; }
	  CLK        = 0 ;	          //CLK拉低
	  DELAY7279  (SYSTEM_OSC/1200000) ;}//短延时
   DAT            = 0 ;	   //DAT线拉低（？？）
   return ( DATAIN ) ;		   //返回DATAIN
   }	      //5.1.2结束
//---------------------------------------------------------
//名称:(5.1.3)DELAY7279B	 功能:HD7279延时
//入口:NUM         出口:无   全局:无   调用模块:  无 
//---------------------------------------------------------
void     DELAY7279 (u8 num)   //7279延时子程序
{
   u8  i;
    
   for (i=num;i!=0;i--) {    //循环等待延时   
	  }
   }		  //5.1.3结束
//---------------------------------------------------------
//名称:(5.1.4)SEND7279_CMD   功能:HD7279发送单字节指令子程序
//入口:CMD    出口:无        全局:无   调用模块:SEND7279B 
//---------------------------------------------------------
void     SEND7279_CMD   (u8 CMD) 
{   
   CS7279         = 0 ;      //选通HD7279芯片
   SEND7279B      (CMD);     //发送CMD指令至HD7279
   CS7279         = 1 ;	     //释放HD7279
   }		  //5.1.4结束
//---------------------------------------------------------
//名称:(5.1.5)SEND7279_CMD_DATA 功能:发送带数据指令子程序
//入口:CMD,DATA  出口:无     全局:无   调用模块:SEND7279B
//---------------------------------------------------------
void     SEND7279_CMD_DATA(u8 CMD,u8 DATA) 
{  
   CS7279         = 0 ;      //选通HD7279芯片
   SEND7279B      (CMD);     //发送CMD指令至HD7279
   SEND7279B      (DATA);    //发送数据至HD7279
   CS7279         = 1 ;	     //释放HD7279
   }		  //5.1.5结束
//---------------------------------------------------------
//名称:(5.1.6)READ7279_KEY   功能:HD7279读取按键键码子程序
//入口:无  出口:KEYNUM  全局:无   调用模块:SEND7279B,RECEIVE7279B  
//---------------------------------------------------------
u8       READ7279_KEY   (void)     //从HD7279读取按键键码
{
   u8     KEYNUM ;

   CS7279         = 0 ;      //选通HD7279芯片
   SEND7279B      (0x15);    //发送读键码指令至HD7279
   KEYNUM		   =RECEIVE7279B();//接收键码
   CS7279         = 1 ;      //释放HD7279
   return (KEYNUM);		     //返回键码KEYNUM
   }		  //5.1.6结束
//---------------------------------------------------------
//名称:(5.1.7)READ7279_NUM   功能:HD7279读取按键键值子程序
//入口:无  出口:NUM     全局:无   调用模块:SEND7279B,RECEIVE7279B  
//---------------------------------------------------------
u8       READ7279_NUM   (void)     //从HD7279读取按键键值
{
	return ( KeyTable[READ7279_KEY()] );		 //返回键值
	}
/*HD7279子程序*****************************/
/***********************************************/
