 //-----------------------------------------------
// 版权归    SivaYao   所有
// 第一次编程时间:2014年07月23日
//-----------------------------------------------
// 文件名：  STC_HW.C
// 编写人：  SivaYao 
// 编写时间：2013/05/26
// 目标器件: STC8A8K
// 编译工具: Keil uV3
//-----------------------------------------------
// 程序说明:
// 此函数库用于STC8A8K最小系统板片上硬件(AD,
//     CCP,SPI,定时器,外部中断,串口等)控制程序
//-----------------------------------------------/

#include     "STC_HW.H"
//***********************************************
//            五/硬件库程序
//***********************************************
/************************************************
//5.1---SystemInit(STC8A8K硬件设置)
************************************************/
//-----------------------------------------------
//5.1.名称------SystemInit()功能:系统硬件配置初始化
//入口:无  出口:无  全局:无     调用模块:无
//-----------------------------------------------
void   SystemInit (void)
{
//1----端口设置---
   P0M0      =  0xFF;
   P0M1      =  0x00;  //P0口--LCD数据高端,强推挽输出;
   P2M0      =  0xFF;
   P2M1      =  0x00;  //P2口--LCD数据低端,强推挽输出;

   P1M0      =  0x00;  //P1[0123]--AD,高阻;P1[45]--SDASCL,准双向;P1[67]--晶振,高阻
   P1M1      =  0xCF;  	
   P3M0      =  0x02;
   P3M1      =  0x00;  //P3[0..7]--RXD,TXD,INT01,T0,CM1,INT23--准双向
   P4M0      =  0x1F;
   P4M1      =  0x00;  //P4[0..4]---CSDA,LCDCS,WR,FCS,2401CS推挽

   P5M0      =  0x20;  //P5[5]--2401CE---推挽
   P5M1      =  0x00;  //P5[01234]--RX3 TX3 RX4 TX4 RST --准双向

   P6M0      =  0xBF;  //P6[0123457]---PWM0123,CSDA2,7279CS,CLK--推挽
   P6M1      =  0x00;  //P6[6]---DAT---准双向
					   
   P7M0      =  0xDF;  //P7[01234]---CCP012,RS,XRST---推挽
   P7M1      =  0x40;  //P7[567]---MOSI,MISO,SCLK---准双向
//2----时钟设置(略)
	 P_SW2     =  0x80;        //启动扩展SFR
   XOSCCR    =  0xC0;        //开启外部晶振
   while ((XOSCCR & 0x01)==0) {};    //等待外部晶振稳定
   CLKDIV    = 0x00;         //系统时钟不分频
   CKSEL     = 0x01;         //时钟切换到外部晶振 */
//3-----定时器配置
//3.1-----T0和T1
   TMOD    = 0x00 ;       //定时器0工作模式0.定时器1模式1(16位自动重装)
   AUXR    = AUXR | 0x80 ;//定时器0不分频
   TH0	   = (65536 - 24576000/400) /256 ;
   TL0	   = (65536 - 24576000/400) %256 ; //定时器0初值(1秒400次中断2.5ms)
   //TR0     = 1 ;  	//定时器0开始运行
   //TR1     = 1 ;    //定时器1开始运行
   ET0     = 1 ;		//定时器0中断许可	*/
//4-----AD配置
   //ADCCFG  = 0x21 ;   //右对齐,速度1(64)
	 //ADC_CONTR=0x80 ;   //打开电源
//   ADC_CONTR = 0x8B;    //上电,启动AD通道2.
//5----串口配置
   AUXR     |= 0x15 ;   //串口1使用定时器2(1T);
   T2H       = (65536 - (24576000/38400/4))/256;//设置波特率38400
   T2L       = (65536 - (24576000/38400/4))%256;
   SCON      = 0x50;    //SM0,SM1=01--8位UART,可变波特率
                        //S0MODE=0,MCE0=0,REN0=1
   ES        = 1; 		  //使能串口1中断
//5----按键(按键阵列和旋转编码盘)中断设置
   INTCLKO |=  0x20;  //EX3 = 1 ;
   EA       =  1	;
	 
   }


/***********************************************/
//5.4---SPI子程序
//5.4.1-------SPI_Conf       (SPI配置程序)
//5.4.2-------SPI_Send       (SPI字节发送程序)
//5.4.3-------SPI_Recv       (SPI字节接收程序)
/***********************************************/

/*****5.4.1----SPI配置程序  SPI_Conf()**********/
void     SPI_Conf  ( void )
{
     P_SW1 &=0xF3 ;   //1--配置SPI管脚
     P_SW1 |=0x08 ;   //   到P7.4到P7.7(固定)
	   SPCTL  = 0x5F;   //2--SPI主机,高位先发,使能SPI,SCLK 3MHz.
	   SPSTAT = 0xc0;   //3--清除中断标志和写中断标志

   }
/*****5.4.2----SPI字节发送接收程序  SPI_Send()******/
u8     SPI_Send       (u8 SPI_DATA)
{
   SPDAT	  =   SPI_DATA;	 //1--写入发送字节
   while ((SPSTAT&0x80)==0)	{;}//2--等待发送完成      
   _nop_();
   SPSTAT = 0xC0;		     //3--写1清除SPIF位
   _nop_(); 
   return(SPDAT);		
   }
/*****5.4.3----SPI字节接收程序  SPI_Recv()******/
u8     SPI_Recv       ( void )
{
   SPI_Send(0x00) ;     	 //1--发送0x00
   return ( SPDAT );   		 //2--返回接收字节
   }

